package com.aiso.spark.util

import scala.collection.mutable

/**
  * Created by avc on 2016/12/23.
  */
object Constant {
  val luomaNumMap = mutable.Map(
    "Ⅰ" -> "1",
    "Ⅱ" -> "2",
    "Ⅲ" -> "3",
    "Ⅳ" -> "4",
    "Ⅴ" -> "5",
    "Ⅵ" -> "6",
    "Ⅶ" -> "7",
    "Ⅷ" -> "8",
    "Ⅸ" -> "9",
    "Ⅹ" -> "10",
    "Ⅺ" -> "11",
    "Ⅻ" -> "12"
  )
  //"XIII","XIV","XV","XVI","XVII","XVIII","XIX","XX"

  val zhNumMap = mutable.Map(
    "一" -> "1",
    "二" -> "2",
    "三" -> "3",
    "四" -> "4",
    "五" -> "5",
    "六" -> "6",
    "七" -> "7",
    "八" -> "8",
    "九" -> "9",
    "十" -> "10",
    "十一" -> "11",
    "十三" -> "12",
    "十四" -> "12",
    "十五" -> "12",
    "十六" -> "12",
    "十七" -> "12",
    "十八" -> "12",
    "十九" -> "12",
    "二十" -> "12",
    "二十一" -> "12",
    "二十二" -> "22",
    "二十三" -> "23",
    "二十四" -> "24",
    "二十五" -> "25",
    "二十六" -> "26"
  )



}
